app/controllers/coins_controller.rb

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2021-11-10 17:43:11.606810"], ["id", 1]]